In [1]:
import pandas as pd

In [2]:

technologies = {
     'Courses':["Spark","PySpark","Hadoop","Python","pandas"],
     'Fee' :[24000,25000,25000,24000,24000],
     'Duration':['30day','50days','55days', '40days','60days'],
     'Discount':[1000,2300,1000,1200,2500]
          }
index_labels=['r1','r2','r3','r4','r5']
df = pd.DataFrame(technologies, index=index_labels)
print(df)

    Courses    Fee Duration  Discount
r1    Spark  24000    30day      1000
r2  PySpark  25000   50days      2300
r3   Hadoop  25000   55days      1000
r4   Python  24000   40days      1200
r5   pandas  24000   60days      2500

In [3]:
# https://www.statology.org/pandas-select-rows-based-on-column-values/
import pandas as pd

#create DataFrame
df = pd.DataFrame({'team': ['A', 'A', 'B', 'B', 'B', 'C', 'C', 'C'],
                   'points': [5, 7, 7, 9, 12, 9, 9, 4],
                   'rebounds': [11, 8, 10, 6, 6, 5, 9, 12],
                   'blocks': [4, 7, 7, 6, 5, 8, 9, 10]})

In [4]:
df

  team  points  rebounds  blocks
0    A       5        11       4
1    A       7         8       7
2    B       7        10       7
3    B       9         6       6
4    B      12         6       5
5    C       9         5       8
6    C       9         9       9
7    C       4        12      10

In [16]:
df.loc[df['points'] == 7]

  team  points  rebounds  blocks
3    B       9         6       6
4    B      12         6       5
5    C       9         5       8
6    C       9         9       9